package com.anyi.common.account.constant;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * <p>
 * 员工账户变动类型枚举类
 * </p>
 *
 * @author shenbh
 * @since 2023.03.10
 */
@Getter
@AllArgsConstructor
public enum EmployAccountChangeEnum {

    /************************************************服务商用到资金变化START******************************************************/

    /**
     * <p>
     * 平台服务费--主类型值为1出 ,具体类型 20010 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(减): -1 <br/>
     */
    recycle_plat_service(1, 20010, "手机交易服务费", 1, -1, 0, 0, 0, 0, 0),
    /**
     * <p>
     * 平台服务费--主类型值为2入 ,具体类型 20014 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(减): -1 <br/>
     */
    recycle_plat_service_cancel(2, 20014, "手机交易服务费", 1, 1, 0, 0, 0, 0, 0),
    /**
     * <p>
     * 二手机回收--主类型值为1出 ,具体类型 40020 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(减): -1 <br/>
     */
    mobile_collect(1, 40020, "手机回收", 1, -1, 0, 0, 0, 0, 0),
    /**
     * <p>
     * 二手机回收--主类型值为2入 ,具体类型 40021 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(加): 1 <br/>
     */
    mobile_collect_cancel(1, 40021, "手机回收", 1, 1, 0, 0, 0, 0, 0),
    /**
     * <p>
     * 服务商充值--主类型值为2 入 ,具体类型 40010 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(加): 1 <br/>
     * 变动账户 累计收益(加):1 <br/>
     */
    recycle_recharge(2, 40010, "充值", 1, 1, 0, 0, 1, 1, 0),
    /**
     * <p>
     * 物流费用--主类型值为1出 ,具体类型 40020 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(减): -1 <br/>
     */
    logistics_fee(1, 40011, "物流费用", 1, -1, 0, 0, 0, 0, 0),

    /************************************************服务商用到资金变化END******************************************************/


    /************************************************门店和代理用到资金变化START******************************************************/

    /**
     * <p>
     * 平台服务费分佣冻结 --主类型值为2入 ,具体类型 20011 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(不变): 0 <br/>
     * 变动账户 冻结金额(加):1 <br/>
     */
    plat_service_commission_froze(2, 20011, "手机交易服务费冻结", 1, 0, 1, 0, 0, 0, 0),

    /**
     * <p>
     * 平台服务费分佣冻结取消 --主类型值为1出 ,具体类型 20012 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(不变): 0 <br/>
     * 变动账户 冻结金额(减):-1 <br/>
     */
    plat_service_commission_froze_cancel(1, 20012, "手机交易服务费退回", 1, 0, -1, 0, 0, 0, 0),

    /**
     * <p>
     * 平台服务费分佣 --主类型值为2入 ,具体类型 20013 ,用户关注类型:否<br/>
     * </p>
     * 变动账户 可用金额(增): 1 <br/>
     * 变动账户 冻结金额(减):-1 <br/>
     * 变动账户 累计收益(加): 1 <br/>
     */
    plat_service_commission(2, 20013, "手机交易服务费", 1, 1, -1, 0, 1, 1, 0),


    /**
     * <p>
     * 门店手机成交冻结 --主类型值为2入 ,具体类型 50010 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(不变): 0 <br/>
     * 变动账户 冻结金额(加):1 <br/>
     */
    mobile_complete_froze(2, 50010, "手机成交冻结", 1, 0, 1, 0, 0, 0, 0),

    /**
     * <p>
     * 门店手机成交取消 --主类型值为1出 ,具体类型 50011 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(不变): 0 <br/>
     * 变动账户 冻结金额(减):-1 <br/>
     */
    mobile_complete_cancel(1, 50011, "手机成交取消", 1, 0, -1, 0, 0, 0, 0),

    /**
     * <p>
     * 门店手机成交 --主类型值为2入 ,具体类型 50012 ,用户关注类型:否<br/>
     * </p>
     * 变动账户 可用金额(增): 1 <br/>
     * 变动账户 冻结金额(减):-1 <br/>
     * 变动账户 累计收益(加): 1 <br/>
     */
    mobile_complete_commission(2, 50012, "手机成交", 1, 1, -1, 0, 1, 1, 0),

    /**
     * <p>
     * 平台补贴发放给做单门店员工 --主类型值为2入 ,具体类型 50013 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(增): 1 <br/>
     * 变动账户 冻结金额(减): 0 <br/>
     * 变动账户 累计收益(加): 1 <br/>
     */
    platform_subsidy_income(2, 50013, "平台补贴", 1, 1, 0, 0, 1, 1, 0),
    /**
     * <p>
     * 平台补贴发放给做单门店员工取消 --主类型值为1出 ,具体类型 50013 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(增): -1 <br/>
     * 变动账户 冻结金额(减): 0 <br/>
     * 变动账户 累计收益(加): 0 <br/>
     */
    platform_subsidy_rollback(1, 50014, "平台补贴", 1, -1, 0, 0, -1, -1, 0),

    /************************************************门店和代理用到资金变化END******************************************************/


    /**
     * <p>
     * 提现--主类型值为1 出 ,具体类型 10010 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(减): -1 <br/>
     * 变动账户 冻结金额(增):1 <br/>
     */
    withdraw(1, 10010, "提现", 1, -1, 1, 0, 0, 0, 0),

    /**
     * <p>
     * 提现--主类型值为2 入 ,具体类型 10011 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(加): 1 <br/>
     * 变动账户 冻结金额(减):-1 <br/>
     * 变动账户 累计提现(不变): 0 <br/>
     */
    withdrawUnPass(2, 10011, "提现失败", 1, 1, -1, 0, 0, 0, 0),

    /**
     * <p>
     * 提现--主类型值为1 出 ,具体类型 10012 ,用户关注类型:否<br/>
     * </p>
     * 变动账户 冻结金额(减):-1 <br/>
     * 变动账户 累计提现(加): 1 <br/>
     */
    withdrawPass(1, 10012, "提现成功", 0, 0, -1, 0, 0, 0, 1),




    /************************************************APP拉新START******************************************************/
    /**
     * <p>
     *  --主类型值为2入 ,具体类型 30010 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(增): 1 <br/>
     * 变动账户 累计收益(加): 1 <br/>
     */
    app_lx_hjzs(2, 30010, "换机助手", 1, 1, 0, 0, 1, 1, 0),
    /**
     * <p>
     *  --主类型值为2入 ,具体类型 30011 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(增): 1 <br/>
     * 变动账户 累计收益(加): 1 <br/>
     */
    app_lx_yjlx(2, 30011, "一键拉新", 1, 1, 0, 0, 1, 1, 0),
    /**
     * <p>
     *  --主类型值为2入 ,具体类型 30012 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(增): 1 <br/>
     * 变动账户 累计收益(加): 1 <br/>
     */
    app_lx_kslz(2, 30012, "快手绿洲", 1, 1, 0, 0, 1, 1, 0),
    /**
     * <p>
     *  --主类型值为2入 ,具体类型 30013 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(增): 1 <br/>
     * 变动账户 累计收益(加): 1 <br/>
     */
    app_lx_pgdy(2, 30013, "苹果抖音", 1, 1, 0, 0, 1, 1, 0),

    /************************************************APP拉新END******************************************************/

    /************************************************数保START******************************************************/
    /**
     * <p>
     *  --主类型值为2入 ,具体类型 60010 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(增): 1 <br/>
     * 变动账户 累计收益(加): 1 <br/>
     */
    insurance_commission(2, 60010, "享转数保", 1, 1, 0, 0, 1, 1, 0),

    /************************************************数保END******************************************************/

    /************************************************号卡START******************************************************/
    /**
     * <p>
     *  --主类型值为2入 ,具体类型 70010 ,用户关注类型:是<br/>
     * </p>
     * 变动账户 可用金额(增): 1 <br/>
     * 变动账户 累计收益(加): 1 <br/>
     */
    hk_commission(2, 70010, "流量卡", 1, 1, 0, 0, 1, 1, 0),

    /************************************************号卡END******************************************************/

    ;

    /**
     * 变动主类型 (0不变 1-支出 2-收入)
     */
    private Integer changeMainType;

    /**
     * 变动类型
     */
    private Integer changeDetailType;
    /**
     * 变动类型描述
     */
    private String remark;
    /**
     * 是否用户关注类型 （指只关注可用余额的变更）
     */
    private Integer isUserFocusType;
    /**
     * 变动账户可用余额(分)
     */
    private int changeAbleBalance;
    /**
     * 变动账户临时冻结金额(分)
     */
    private int changeTempFrozenBalance;
    /**
     * 变动账户被封金额(分)
     */
    private int changeFrozenBalance;
    /**
     * 变动账户钱包累计入账(分)
     */
    private int changeAccumulateIncome;

    /**
     * 变动账户 团队佣金累计入账(分)
     */
    private int changeAccAwardIncome;

    /**
     * 变动账户 累计提现(分)
     */
    private int changeAccWithdraw;


}